
# Задание 1
"""
Дан список с визитами по городам и странам.  Напишите код, который возвращает отфильтрованный список geo_logs, содержащий только визиты из России."
geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]
"""

# geo_logs: list[dict[str, list[str]]
geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]
geo_logs_rus = []
for my_dict in geo_logs:
    for my_id, my_data in my_dict.items():
        if my_data[1] == 'Россия':
            geo_logs_rus.append(my_dict)

        # if my_data[1] != 'Россия':
            # geo_logs_rus.remove(my_dict) # ПОЧЕМУ УДАЛЯЕТСЯ В ИСХОДНОМ list, в начале мы geo_logs_rus = geo_logs ?

print(f'\n{geo_logs_rus}')
print(f'\n{geo_logs}')


